<html>
    <head>
        <title>Proto Certae</title>

        <!-- Ext JS Files -->
        <link rel="stylesheet" type="text/css" href="app.css">

    </head>

<body>

<table class=\"table_interieure\"><tr><td>800</td><td>Cessation reli\u00e9e \u00e0 la r\u00e9alisation des objectifs</td><td>Fin de services pour l\u2019usager (individu, groupe ou communautaire) en raison de la r\u00e9alisation des<br>objectifs fix\u00e9s dans le plan d\u2019intervention ou le plan d\u2019action.</td><br></tr><tr><td>810</td><td>Cessation reli\u00e9e au d\u00e9c\u00e8s</td><td>Fin des services due au d\u00e9c\u00e8s de l\u2019usager.</td><br></tr><tr><td>820</td><td>Cessation reli\u00e9e au d\u00e9m\u00e9nagement</td><td>Fin des services due au d\u00e9m\u00e9nagement de l\u2019usager \u00e0 l\u2019ext\u00e9rieur du territoire du CSSS.</td><br></tr><tr><td>830</td><td>Cessation reli\u00e9e \u00e0 l\u2019h\u00e9bergement</td><td>Fin des services due \u00e0 l\u2019h\u00e9bergement de l\u2019usager, dans une ressource institutionnelle ou non.</td><br></tr><tr><td>840</td><td>Cessation reli\u00e9e \u00e0 l\u2019hospitalisation</td><td>Fin des services due \u00e0 l\u2019hospitalisation de l\u2019usager.</td><br></tr><tr><td>850</td><td>Cessation reli\u00e9e au recours \u00e0 des ressources priv\u00e9es</td><td>Fin des services due au recours \u00e0 des ressources priv\u00e9es.</td><br></tr><tr><td>900</td><td>Cessation reli\u00e9e au refus de l\u2019usager de recevoir des services du CLSC (mission CLSC)</td><td>Fin des services due \u00e0 l\u2019usager qui refuse de recevoir des services, quelle qu\u2019en soit la raison.</td><br></tr><tr><td>950</td><td> Cessation reli\u00e9e au refus du CSSS (mission CLSC) d\u2019intervenir</td><td>Fin de service due \u00e0 la d\u00e9cision du CSSS (mission CLSC) de mettre fin aux services en raison de contraintes diverses <br>(ex. : manque de coop\u00e9ration de la part de l\u2019usager).</td><br></tr><tr><td>990</td><td>Tout autre motif de cessation</td><td>Fin des services due \u00e0 tout autre motif de cessation</td><br></tr><br></table>

</body>
</html>
